TexasInstruments/f29h85x-mcal/examples/Cdd_Dma/Cdd_Dma_Example_Adc_Data_Binning/F29H85x/Cdd_Dma_Example_Adc_Data_Binning_Config/output/src/Mcu_Cfg.c
 /*
 * Design: MCAL-21901
 */

static CONST(Mcu_PeripheralClkRegConfigType, MCU_CONFIG_DATA) Mcu_PerClkCfgSet0[3] =
{
    {
    /* Peripheral Clock Gating Register0 (PCLKCR0) */
    (uint32)((0x00000000U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<19U)
    |(1UL<<20U)
    |(1UL<<24U)
    |(1UL<<25U)),

    /* Peripheral Clock Gating Register1 (PCLKCR1) */
    (uint32)((0x00000000U)
    |(1UL<<0U)),

    /* Peripheral Clock Gating Register2 (PCLKCR2) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<7U)
    |(1UL<<8U)
    |(1UL<<9U)
    |(1UL<<10U)
    |(1UL<<11U)
    |(1UL<<12U)
    |(1UL<<13U)
    |(1UL<<14U)
    |(1UL<<15U)
    |(1UL<<16U)
    |(1UL<<17U)),

    /* Peripheral Clock Gating Register3 (PCLKCR3) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)),

    /* Peripheral Clock Gating Register4 (PCLKCR4) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)),

    /* Peripheral Clock Gating Register6 (PCLKCR6) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)),

    /* Peripheral Clock Gating Register7 (PCLKCR7) */
    (uint32)((0x00000000U)
    |(1UL<<16U)
    |(1UL<<17U)
    |(1UL<<18U)
    |(1UL<<19U)
    |(1UL<<20U)
    |(1UL<<21U)),

    /* Peripheral Clock Gating Register8 (PCLKCR8) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)),

    /* Peripheral Clock Gating Register9 (PCLKCR9) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)),

    /* Peripheral Clock Gating Register10 (PCLKCR10) */
    (uint32)((0x00000000U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<7U)
    |(1UL<<8U)
    |(1UL<<9U)),

    /* Peripheral Clock Gating Register13 (PCLKCR13) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)),

    /* Peripheral Clock Gating Register14 (PCLKCR14) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<7U)
    |(1UL<<8U)
    |(1UL<<9U)
    |(1UL<<10U)
    |(1UL<<11U)),

    /* Peripheral Clock Gating Register16 (PCLKCR16) */
    (uint32)((0x00000000U)
    |(1UL<<16U)
    |(1UL<<17U)),

    /* Peripheral Clock Gating Register17 (PCLKCR17) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)),

    /* Peripheral Clock Gating Register18 (PCLKCR18) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<16U)
    |(1UL<<17U)
    |(1UL<<18U)
    |(1UL<<19U)),

    /* Peripheral Clock Gating Register19 (PCLKCR19) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)),

    /* Peripheral Clock Gating Register20 (PCLKCR20) */
    (uint32)((0x00000000U)
    |(1UL<<0U)),

    /* Peripheral Clock Gating Register21 (PCLKCR21) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)),

    /* Peripheral Clock Gating Register23 (PCLKCR23) */
    (uint32)((0x00000000U)
    |(1UL<<0U)),

    /* Peripheral Clock Gating Register25 (PCLKCR25) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)),

    /* Peripheral Clock Gating Register27 (PCLKCR27) */
    (uint32)((0x00000000U)
    |(1UL<<0U)),

    /* Peripheral Clock Gating Register28 (PCLKCR28) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<7U)
    |(1UL<<8U)
    |(1UL<<9U)
    |(1UL<<16U)
    |(1UL<<17U)
    |(1UL<<18U)),

    /* Peripheral Clock Gating Register30 (PCLKCR30) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)),

    /* Peripheral Clock Gating Register32 (PCLKCR32) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)),
    },
    {
    /* Peripheral Clock Gating Register0 (PCLKCR0) */
    (uint32)((0x00000000U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<19U)
    |(1UL<<20U)
    |(1UL<<24U)
    |(1UL<<25U)),

    /* Peripheral Clock Gating Register1 (PCLKCR1) */
    (uint32)((0x00000000U)
    |(1UL<<0U)),

    /* Peripheral Clock Gating Register2 (PCLKCR2) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<7U)
    |(1UL<<8U)
    |(1UL<<9U)
    |(1UL<<10U)
    |(1UL<<11U)
    |(1UL<<12U)
    |(1UL<<13U)
    |(1UL<<14U)
    |(1UL<<15U)
    |(1UL<<16U)
    |(1UL<<17U)),

    /* Peripheral Clock Gating Register3 (PCLKCR3) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)),

    /* Peripheral Clock Gating Register4 (PCLKCR4) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)),

    /* Peripheral Clock Gating Register6 (PCLKCR6) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)),

    /* Peripheral Clock Gating Register7 (PCLKCR7) */
    (uint32)((0x00000000U)
    |(1UL<<16U)
    |(1UL<<17U)
    |(1UL<<18U)
    |(1UL<<19U)
    |(1UL<<20U)
    |(1UL<<21U)),

    /* Peripheral Clock Gating Register8 (PCLKCR8) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)),

    /* Peripheral Clock Gating Register9 (PCLKCR9) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)),

    /* Peripheral Clock Gating Register10 (PCLKCR10) */
    (uint32)((0x00000000U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<7U)
    |(1UL<<8U)
    |(1UL<<9U)),

    /* Peripheral Clock Gating Register13 (PCLKCR13) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)),

    /* Peripheral Clock Gating Register14 (PCLKCR14) */
    (uint32)((0x00000000U)
    |(1UL<<0U)
    |(1UL<<1U)
    |(1UL<<2U)
    |(1UL<<3U)
    |(1UL<<4U)
    |(1UL<<5U)
    |(1UL<<6U)
    |(1UL<<7U)
    |(1UL<<8U)
    |(1UL<<9U)
    |(1UL<<10U)
    |(1UL<<11U)),

