TexasInstruments/f29h85x-mcal/examples/Cdd_Dma/Cdd_Dma_Example_Adc_Data_Binning/F29H85x/Cdd_Dma_Example_Adc_Data_Binning_Config/output/src/Mcu_Cfg.c
    /* Peripheral Reset Register6 (SOFTPRES6) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)),

    /* Peripheral Reset Register7 (SOFTPRES7) */
    (uint32)((0x00000000U)
    |(0UL<<16U)
    |(0UL<<17U)
    |(0UL<<18U)
    |(0UL<<19U)
    |(0UL<<20U)
    |(0UL<<21U)),

    /* Peripheral Reset Register8 (SOFTPRES8) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)),

    /* Peripheral Reset Register9 (SOFTPRES9) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)),

    /* Peripheral Reset Register10 (SOFTPRES10) */
    (uint32)((0x00000000U)
    |(0UL<<4U)
    |(0UL<<5U)
    |(0UL<<6U)
    |(0UL<<7U)
    |(0UL<<8U)
    |(0UL<<9U)),

    /* Peripheral Reset Register13 (SOFTPRES13) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)),

    /* Peripheral Reset Register14 (SOFTPRES14) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)
    |(0UL<<6U)
    |(0UL<<7U)
    |(0UL<<8U)
    |(0UL<<9U)
    |(0UL<<10U)
    |(0UL<<11U)),

    /* Peripheral Reset Register16 (SOFTPRES16) */
    (uint32)((0x00000000U)
    |(0UL<<16U)
    |(0UL<<17U)),

    /* Peripheral Reset Register17 (SOFTPRES17) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)),

    /* Peripheral Reset Register18 (SOFTPRES18) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<16U)
    |(0UL<<17U)
    |(0UL<<18U)
    |(0UL<<19U)),

    /* Peripheral Reset Register19 (SOFTPRES19) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)),

    /* Peripheral Reset Register20 (SOFTPRES20) */
    (uint32)((0x00000000U)
    |(0UL<<0U)),

    /* Peripheral Reset Register21 (SOFTPRES21) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)),

    /* Peripheral Reset Register23 (SOFTPRES23) */
    (uint32)((0x00000000U)
    |(0UL<<0U)),

    /* Peripheral Reset Register25 (SOFTPRES25) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)),

    /* Peripheral Reset Register27 (SOFTPRES27) */
    (uint32)((0x00000000U)
    |(0UL<<0U)),

    /* Peripheral Reset Register28 (SOFTPRES28) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)
    |(0UL<<6U)
    |(0UL<<7U)
    |(0UL<<8U)
    |(0UL<<9U)
    |(0UL<<16U)
    |(0UL<<17U)
    |(0UL<<18U)),

    /* Peripheral Reset Register30 (SOFTPRES30) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)),

    /* Peripheral Reset Register32 (SOFTPRES32) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)),
    },
    {
    /* Peripheral Reset Register0 (SOFTPRES0) */
    (uint32)((0x00000000U)
    |(0UL<<4U)
    |(0UL<<24U)
    |(0UL<<25U)),

    /* Peripheral Reset Register1 (SOFTPRES1) */
    (uint32)((0x00000000U)
    |(0UL<<0U)),

    /* Peripheral Reset Register2 (SOFTPRES2) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)
    |(0UL<<6U)
    |(0UL<<7U)
    |(0UL<<8U)
    |(0UL<<9U)
    |(0UL<<10U)
    |(0UL<<11U)
    |(0UL<<12U)
    |(0UL<<13U)
    |(0UL<<14U)
    |(0UL<<15U)
    |(0UL<<16U)
    |(0UL<<17U)),

    /* Peripheral Reset Register3 (SOFTPRES3) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)),

    /* Peripheral Reset Register4 (SOFTPRES4) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)),

    /* Peripheral Reset Register6 (SOFTPRES6) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)),

    /* Peripheral Reset Register7 (SOFTPRES7) */
    (uint32)((0x00000000U)
    |(0UL<<16U)
    |(0UL<<17U)
    |(0UL<<18U)
    |(0UL<<19U)
    |(0UL<<20U)
    |(0UL<<21U)),

    /* Peripheral Reset Register8 (SOFTPRES8) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)),

    /* Peripheral Reset Register9 (SOFTPRES9) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)),

    /* Peripheral Reset Register10 (SOFTPRES10) */
    (uint32)((0x00000000U)
    |(0UL<<4U)
    |(0UL<<5U)
    |(0UL<<6U)
    |(0UL<<7U)
    |(0UL<<8U)
    |(0UL<<9U)),

    /* Peripheral Reset Register13 (SOFTPRES13) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)),

    /* Peripheral Reset Register14 (SOFTPRES14) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)
    |(0UL<<6U)
    |(0UL<<7U)
    |(0UL<<8U)
    |(0UL<<9U)
    |(0UL<<10U)
    |(0UL<<11U)),

    /* Peripheral Reset Register16 (SOFTPRES16) */
    (uint32)((0x00000000U)
    |(0UL<<16U)
    |(0UL<<17U)),

    /* Peripheral Reset Register17 (SOFTPRES17) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<4U)
    |(0UL<<5U)),

    /* Peripheral Reset Register18 (SOFTPRES18) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)
    |(0UL<<3U)
    |(0UL<<16U)
    |(0UL<<17U)
    |(0UL<<18U)
    |(0UL<<19U)),

    /* Peripheral Reset Register19 (SOFTPRES19) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)),

    /* Peripheral Reset Register20 (SOFTPRES20) */
    (uint32)((0x00000000U)
    |(0UL<<0U)),

    /* Peripheral Reset Register21 (SOFTPRES21) */
    (uint32)((0x00000000U)
    |(0UL<<0U)
    |(0UL<<1U)
    |(0UL<<2U)),

