TexasInstruments/f29h85x-mcal/examples/Cdd_Dma/Cdd_Dma_Example_Adc_Data_Binning/F29H85x/Cdd_Dma_Example_Adc_Data_Binning_Config/output/src/Mcu_Cfg.c
static CONST(Mcu_LinClkConfigType, MCU_CONFIG_DATA) Mcu_LinClkCfgSet1[1] =
{
    {
    /* Lin clock configuration settings */
    .Mcu_LinInstance    = ((Mcu_LINInstance) MCU_LIN_A),
    .Mcu_LinClkDiv      = ((Mcu_LINClkDivider) MCU_LINCLK_DIV_2),
    }   
};


static CONST(Mcu_LinClkConfigType, MCU_CONFIG_DATA) Mcu_LinClkCfgSet2[1] =
{
    {
    /* Lin clock configuration settings */
    .Mcu_LinInstance    = ((Mcu_LINInstance) MCU_LIN_A),
    .Mcu_LinClkDiv      = ((Mcu_LINClkDivider) MCU_LINCLK_DIV_2),
    }   
};



/*
 * Design: MCAL-21870, MCAL-21871, MCAL-21886, MCAL-21887, MCAL-21888, MCAL-21889,
 * Design: MCAL-21891, MCAL-21892, MCAL-21893, MCAL-21894, MCAL-21895, MCAL-21896,
 * Design: MCAL-21897, MCAL-21898, MCAL-21899, MCAL-21900, MCAL-21901, MCAL-21872, MCAL-21873
 */

static CONST(Mcu_ClockConfigType, MCU_CONFIG_DATA) Mcu_ClkCfgSet0[3] =
{
    {
    .Mcu_ClockSourceId = ((Mcu_ClkSourceIdType) MCU_CLKSRC_OSC2),
    .Mcu_PeripheralClkConfigPtr = ((Mcu_PeripheralClkRegConfigPtrType) &Mcu_PerClkCfgSet0[0]),
    .Mcu_PeripheralResetConfigPtr = ((Mcu_PeripheralResetRegConfigPtrType) &Mcu_PerResetCfgSet0[0]),
    .Mcu_MCanInstancesCount     = ((uint32) 1U),
    .Mcu_LinInstancesCount      = ((uint32) 1U),
    .Mcu_MCanClkConfig          = ((Mcu_MCanClkConfigPtrType) Mcu_MCanClkCfgSet0),
    .Mcu_LinClkConfig           = ((Mcu_LinClkConfigPtrType) Mcu_LinClkCfgSet0),
    .Mcu_CpuTimerClkConfig = {
        .Mcu_CpuTimer2ClkSource = ((Mcu_CpuTimerClkSrc) MCU_CPUTIMERCLKSRC_SYSCLK),
        .Mcu_CpuTimer2ClkDiv    = ((uint8) 1U)
    },
    .Mcu_ExternalClkOutConfig = {
        .Mcu_ExternalClockOutSource = ((Mcu_ExternalClockOutClkSrc) MCU_XCLKOUTSRC_PLLSYS),
        .Mcu_ExternalClkOutDiv      = ((Mcu_ExternalClockOutDiv) MCU_XCLKOUT_DIV_8),
        .Mcu_ExternalClockOut       = ((boolean) TRUE)
    },
    .Mcu_EthercatClkConfig = {
        .Mcu_EthercatClkDiv       = ((Mcu_EthercatClockDiv) MCU_ECATCLKOUT_DIV_8),
        .Mcu_EthercatPhyClkEnable = ((Mcu_EthercatPhyClk)   MCU_ECAT_PHYCLK_ENABLE)
    },
    .Mcu_ExternalClkFreq = ((uint32) 20000000U),
    .Mcu_SysClkDiv       = ((uint8) 2U),
    .Mcu_HsmClkDiv       = ((Mcu_HsmClockDiv) MCU_HSMCLK_DIV_16),
    .Mcu_EpwmClkDiv      = ((Mcu_EPWMClkDivider) MCU_EPWMCLK_DIV_1),
    .Mcu_EmifClkDiv      = ((Mcu_EMIFClkDivider) MCU_EMIFCLK_DIV_2),
    
    .Mcu_PllRefDiv       = ((uint8) 1U),
    .Mcu_PllIntMult      = ((uint8) 40U),
    .Mcu_PllOutDiv       = ((uint8) 1U),
    },
    {
    .Mcu_ClockSourceId = ((Mcu_ClkSourceIdType) MCU_CLKSRC_XTAL),
    .Mcu_PeripheralClkConfigPtr = ((Mcu_PeripheralClkRegConfigPtrType) &Mcu_PerClkCfgSet0[1]),
    .Mcu_PeripheralResetConfigPtr = ((Mcu_PeripheralResetRegConfigPtrType) &Mcu_PerResetCfgSet0[1]),
    .Mcu_MCanInstancesCount     = ((uint32) 1U),
    .Mcu_LinInstancesCount      = ((uint32) 1U),
    .Mcu_MCanClkConfig          = ((Mcu_MCanClkConfigPtrType) Mcu_MCanClkCfgSet1),
    .Mcu_LinClkConfig           = ((Mcu_LinClkConfigPtrType) Mcu_LinClkCfgSet1),
    .Mcu_CpuTimerClkConfig = {
        .Mcu_CpuTimer2ClkSource = ((Mcu_CpuTimerClkSrc) MCU_CPUTIMERCLKSRC_SYSCLK),
        .Mcu_CpuTimer2ClkDiv    = ((uint8) 1U)
    },
    .Mcu_ExternalClkOutConfig = {
        .Mcu_ExternalClockOutSource = ((Mcu_ExternalClockOutClkSrc) MCU_XCLKOUTSRC_PLLSYS),
        .Mcu_ExternalClkOutDiv      = ((Mcu_ExternalClockOutDiv) MCU_XCLKOUT_DIV_8),
        .Mcu_ExternalClockOut       = ((boolean) FALSE)
    },
    .Mcu_EthercatClkConfig = {
        .Mcu_EthercatClkDiv       = ((Mcu_EthercatClockDiv) MCU_ECATCLKOUT_DIV_8),
        .Mcu_EthercatPhyClkEnable = ((Mcu_EthercatPhyClk)   MCU_ECAT_PHYCLK_ENABLE)
    },
    .Mcu_ExternalClkFreq = ((uint32) 20000000U),
    .Mcu_SysClkDiv       = ((uint8) 2U),
    .Mcu_HsmClkDiv       = ((Mcu_HsmClockDiv) MCU_HSMCLK_DIV_16),
    .Mcu_EpwmClkDiv      = ((Mcu_EPWMClkDivider) MCU_EPWMCLK_DIV_2),
    .Mcu_EmifClkDiv      = ((Mcu_EMIFClkDivider) MCU_EMIFCLK_DIV_2),
    
    .Mcu_PllRefDiv       = ((uint8) 1U),
    .Mcu_PllIntMult      = ((uint8) 20U),
    .Mcu_PllOutDiv       = ((uint8) 1U),
    },
    {
    .Mcu_ClockSourceId = ((Mcu_ClkSourceIdType) MCU_CLKSRC_XTAL_SE),
    .Mcu_PeripheralClkConfigPtr = ((Mcu_PeripheralClkRegConfigPtrType) &Mcu_PerClkCfgSet0[2]),
    .Mcu_PeripheralResetConfigPtr = ((Mcu_PeripheralResetRegConfigPtrType) &Mcu_PerResetCfgSet0[2]),
    .Mcu_MCanInstancesCount     = ((uint32) 1U),
    .Mcu_LinInstancesCount      = ((uint32) 1U),
    .Mcu_MCanClkConfig          = ((Mcu_MCanClkConfigPtrType) Mcu_MCanClkCfgSet2),
    .Mcu_LinClkConfig           = ((Mcu_LinClkConfigPtrType) Mcu_LinClkCfgSet2),
    .Mcu_CpuTimerClkConfig = {
        .Mcu_CpuTimer2ClkSource = ((Mcu_CpuTimerClkSrc) MCU_CPUTIMERCLKSRC_SYSCLK),
        .Mcu_CpuTimer2ClkDiv    = ((uint8) 1U)
    },
    .Mcu_ExternalClkOutConfig = {
        .Mcu_ExternalClockOutSource = ((Mcu_ExternalClockOutClkSrc) MCU_XCLKOUTSRC_PLLSYS),
        .Mcu_ExternalClkOutDiv      = ((Mcu_ExternalClockOutDiv) MCU_XCLKOUT_DIV_8),
        .Mcu_ExternalClockOut       = ((boolean) FALSE)
    },
    .Mcu_EthercatClkConfig = {
        .Mcu_EthercatClkDiv       = ((Mcu_EthercatClockDiv) MCU_ECATCLKOUT_DIV_8),
        .Mcu_EthercatPhyClkEnable = ((Mcu_EthercatPhyClk)   MCU_ECAT_PHYCLK_ENABLE)
    },
    .Mcu_ExternalClkFreq = ((uint32) 25000000U),
    .Mcu_SysClkDiv       = ((uint8) 2U),
    .Mcu_HsmClkDiv       = ((Mcu_HsmClockDiv) MCU_HSMCLK_DIV_16),
    .Mcu_EpwmClkDiv      = ((Mcu_EPWMClkDivider) MCU_EPWMCLK_DIV_2),
    .Mcu_EmifClkDiv      = ((Mcu_EMIFClkDivider) MCU_EMIFCLK_DIV_2),
    
    .Mcu_PllRefDiv       = ((uint8) 2U),
    .Mcu_PllIntMult      = ((uint8) 32U),
    .Mcu_PllOutDiv       = ((uint8) 1U),
    }
};


/*
 * Design: MCAL-21878, MCAL-21879, MCAL-21880, MCAL-21881, MCAL-21882
 */

static CONST(Mcu_RamSectionConfigType, MCU_CONFIG_DATA) Mcu_RamSectionCfgSet0[0] =
{

};


