TexasInstruments/f29h85x-mcal/examples/Cdd_Dma/Cdd_Dma_Example_Adc_Data_Binning/F29H85x/Cdd_Dma_Example_Adc_Data_Binning_Config/output/src/Mcu_Cfg.c
/*
 * Design: MCAL-21876, MCAL-21877, MCAL-21902, MCAL-21903
 */

static CONST(Mcu_ModeConfigType, MCU_CONFIG_DATA) Mcu_ModeConfigurationSet0[2] =
{
    {
    .Mcu_LowPowerMode   = ((Mcu_LowPowerModeType) MCU_IDLE_MODE),
    .Mcu_QualPeriod     = ((uint16) 0U),
    .Mcu_EnableWDWakeup = ((boolean) FALSE),
    },
    {
    .Mcu_LowPowerMode   = ((Mcu_LowPowerModeType) MCU_STANDBY_MODE),
    .Mcu_QualPeriod     = ((uint16) 2U),
    .Mcu_EnableWDWakeup = ((boolean) FALSE),
    }
};


/*<MCU_CFG_CONFIG>*/
/*
 * Design: MCAL-21865, MCAL-21866, MCAL-21867, MCAL-21868, MCAL-21869, MCAL-21866
 */
/* Forward declaration of peripheral configuration structure */
static CONST(Mcu_PeripheralConfigType, MCU_CONFIG_DATA) Mcu_PeripheralConfig;
/* Forward declaration of ASysCtl configuration structure */
static CONST(Mcu_ASysCtlConfigType, MCU_CONFIG_DATA) Mcu_ASysCtlConfig;

CONST(Mcu_ConfigType, MCU_CONFIG_DATA) Mcu_Config_Mcu_ModuleConfiguration_0 =
{
    /* Mcu_ClockConfig */
    .Mcu_ClockConfig               = ((Mcu_ClockConfigPtrType) Mcu_ClkCfgSet0),
    /* Mcu_ConfigRamSection */
    .Mcu_ConfigRamSection          = ((Mcu_RamConfigPtrType) Mcu_RamSectionCfgSet0),
    /* Mcu_ModeConfig */
    .Mcu_ModeConfig                = ((Mcu_ModeConfigPtrType) Mcu_ModeConfigurationSet0),
    /* Mcu_ClockSetting */
    .Mcu_ClockSetting              = ((uint8) 3U),
    /* Mcu_NumberOfRamSectors */
    .Mcu_NumberOfRamSectors        = ((uint8) 0U),
    /* Mcu_ModesNumber */
    .Mcu_NumberOfLowPowerModes     = ((uint8) 2U),
    /* Mcu_ResetSetting */
    .Mcu_ResetSetting              = ((Mcu_ResetType) MCU_EXTERNAL_RESET),
    /* Mcu_EnableClkFailNotification */
    .Mcu_EnableClkFailNotification = ((boolean) TRUE),
    /* Peripheral Configuration */
    .PeripheralConfig              = &Mcu_PeripheralConfig,
    /* CPU1 Lockstep Enable Configuration */
    .Mcu_LockstepEnable            = ((boolean) TRUE),
    /* ASysCtl Configuration */
    .Mcu_ASysCtlConfig             = &Mcu_ASysCtlConfig,
    /* CMPSS ASysCtl Configuration */
    .Mcu_CMPSSASysCtlConfig        = NULL_PTR
};



/*********************************************************************************************************************
 *  Peripheral Configuration Register Array Generation
 *
 *  This section generates peripheral configuration arrays from ResourceAllocator XDM configuration.
 *  Each peripheral configuration register has the following bit layout:
 *    - Bits 31-8: Reserved (0)
 *    - Bit 7: DBGHALTEN - Debug halt enable (1=enabled, 0=disabled)
 *    - Bit 6: STANDBYEN - Standby mode enable (1=enabled, 0=disabled)
 *    - Bits 5-3: CPUSEL - CPU selection (000=CPU1, 001=CPU2, 010=CPU3)
 *    - Bits 2-0: FRAMESEL - Frame selection (000=FRAME0, 001=FRAME1, 010=FRAME2, 011=FRAME3)
 *********************************************************************************************************************/
/*********************************************************************************************************************
 *  Peripheral Configuration Array
 *
 *  Contains configuration entries for all peripherals with Frame configuration from ResourceAllocator.
 *  Each entry specifies the register address and the configuration value to write.
 *********************************************************************************************************************/
static CONST(Mcu_PeripheralRegEntryType, MCU_CONFIG_DATA) Mcu_PeripheralConfigSet[] =
{
                            
    /* CDD_ADCA Configuration - CPU1, FRAME0, DbgHalt=true, Standby=true */
    {
        .RegAddr = (uint32)(DEVCFG_BASE + SYSCTL_O_ADCA),
        .RegValue = (uint32)0x000000C0U
    },

    /* EPWM1 Configuration - CPU1, FRAME0, DbgHalt=true, Standby=true */
    {
        .RegAddr = (uint32)(DEVCFG_BASE + SYSCTL_O_EPWM1),
        .RegValue = (uint32)0x000000C0U
    }
,

    /* RTDMA1 Configuration - FRAME0 */
    {
        .RegAddr = (uint32)(DEVCFG_BASE + SYSCTL_O_RTDMA1CH),
        .RegValue = (uint32)0x00000000U
    }};

/*********************************************************************************************************************
 *  Peripheral Configuration Structure
 *
 *  This structure wraps the peripheral configuration array and count for use by Mcu_Init.
 *  The PeripheralConfigEntries pointer references the Mcu_PeripheralConfigSet array, which
 *  contains struct entries with RegAddr and RegValue fields.
 *********************************************************************************************************************/
static CONST(Mcu_PeripheralConfigType, MCU_CONFIG_DATA) Mcu_PeripheralConfig =
{
    .PeripheralConfigEntries = Mcu_PeripheralConfigSet,
    .PeripheralConfigCount   = 3U
};

/*********************************************************************************************************************
 *  ASysCtl Configuration Structure
 *
 *  This structure holds the Analog System Control (ASysCtl) configuration generated from the
 *  ResourceAllocator plugin. It is consumed by Mcu_Priv_ConfigureASysCtl() during Mcu_Init().
 *********************************************************************************************************************/
static CONST(Mcu_ASysCtlConfigType, MCU_CONFIG_DATA) Mcu_ASysCtlConfig =
{
    .TemperatureSensorEnable = (boolean)FALSE,
    .AnalogRefABMode         = (uint8)FALSE,
    .AnalogRefABVoltage      = (uint8)TRUE,
    .AnalogRefCDEMode        = (uint8)FALSE,
    .AnalogRefCDEVoltage     = (uint8)FALSE,
    .VMONMaskEnable          = (boolean)FALSE,
    .VREGPowerDown           = (boolean)FALSE,
    .BORLDisable             = (boolean)FALSE,
    .InternalTestNodeSelect  = (Mcu_ASysCtlTestNodeType)MCU_ASYSCTL_TEST_NODE_NO_CONN
};

/*********************************************************************************************************************
 *  Local Function Prototypes
 *********************************************************************************************************************/
 
/*********************************************************************************************************************
 *  Local Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  External Functions Definition
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Local Functions Definition
 *********************************************************************************************************************/
#define MCU_STOP_SEC_CONFIG_DATA
#include "Mcu_MemMap.h"

/*********************************************************************************************************************
 *  End of File: Mcu_Cfg.c
 *********************************************************************************************************************/
